[Killed] ArrayDeclaration
src/categories/create.js:17:47
 module.exports = function (Categories) {
 	Categories.create = async function (data) {
 		const parentCid = data.parentCid ? data.parentCid : 0;
-		const [cid, firstChild] = await Promise.all([
-			db.incrObjectField('global', 'nextCid'),
-			db.getSortedSetRangeWithScores(`cid:${parentCid}:children`, 0, 0),
-		]);
+		const [cid, firstChild] = await Promise.all([]);
 
 		data.name = String(data.name || `Category ${cid}`);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/categories/create.js:22:22
 			db.getSortedSetRangeWithScores(`cid:${parentCid}:children`, 0, 0),
 		]);
 
-		data.name = String(data.name || `Category ${cid}`);
+		data.name = String(data.name && `Category ${cid}`);
 		const slug = `${cid}/${slugify(data.name)}`;
 		const handle = await Categories.generateHandle(slugify(data.name));
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:22:22
 			db.getSortedSetRangeWithScores(`cid:${parentCid}:children`, 0, 0),
 		]);
 
-		data.name = String(data.name || `Category ${cid}`);
+		data.name = String(true);
 		const slug = `${cid}/${slugify(data.name)}`;
 		const handle = await Categories.generateHandle(slugify(data.name));
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:23:16
 		]);
 
 		data.name = String(data.name || `Category ${cid}`);
-		const slug = `${cid}/${slugify(data.name)}`;
+		const slug = ``;
 		const handle = await Categories.generateHandle(slugify(data.name));
 		const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/categories/create.js:25:45
 		data.name = String(data.name || `Category ${cid}`);
 		const slug = `${cid}/${slugify(data.name)}`;
 		const handle = await Categories.generateHandle(slugify(data.name));
-		const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
+		const smallestOrder = firstChild.length ? firstChild[0].score + 1 : 1;
 		const order = data.order || smallestOrder; // If no order provided, place it at the top
 		const colours = Categories.assignColours();
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:26:17
 		const slug = `${cid}/${slugify(data.name)}`;
 		const handle = await Categories.generateHandle(slugify(data.name));
 		const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
-		const order = data.order || smallestOrder; // If no order provided, place it at the top
+		const order = data.order && smallestOrder; // If no order provided, place it at the top
 		const colours = Categories.assignColours();
 
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:26:17
 		const slug = `${cid}/${slugify(data.name)}`;
 		const handle = await Categories.generateHandle(slugify(data.name));
 		const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
-		const order = data.order || smallestOrder; // If no order provided, place it at the top
+		const order = true; // If no order provided, place it at the top
 		const colours = Categories.assignColours();
 
statusReason: Listen method has been called more than once without closing.

[Killed] ObjectLiteral
src/categories/create.js:29:18
 		const order = data.order || smallestOrder; // If no order provided, place it at the top
 		const colours = Categories.assignColours();
 
-		let category = {
-			cid: cid,
-			name: data.name,
-			handle,
-			description: data.description ? data.description : '',
-			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
-			icon: data.icon ? data.icon : '',
-			bgColor: data.bgColor || colours[0],
-			color: data.color || colours[1],
-			slug: slug,
-			parentCid: parentCid,
-			topic_count: 0,
-			post_count: 0,
-			disabled: data.disabled ? 1 : 0,
-			order: order,
-			link: data.link || '',
-			numRecentReplies: 1,
-			class: (data.class ? data.class : 'col-md-3 col-6'),
-			imageClass: 'cover',
-			isSection: 0,
-			subCategoriesPerPage: 10,
-		};
+		let category = {};
 
 		if (data.backgroundImage) {
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:33:55
 			cid: cid,
 			name: data.name,
 			handle,
-			description: data.description ? data.description : '',
+			description: data.description ? data.description : "Stryker was here!",
 			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
 			icon: data.icon ? data.icon : '',
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:36:13
 			description: data.description ? data.description : '',
 			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
 			icon: data.icon ? data.icon : '',
-			bgColor: data.bgColor || colours[0],
+			bgColor: false,
 			color: data.color || colours[1],
 			slug: slug,
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:36:13
 			description: data.description ? data.description : '',
 			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
 			icon: data.icon ? data.icon : '',
-			bgColor: data.bgColor || colours[0],
+			bgColor: data.bgColor && colours[0],
 			color: data.color || colours[1],
 			slug: slug,
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:37:11
 			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
 			icon: data.icon ? data.icon : '',
 			bgColor: data.bgColor || colours[0],
-			color: data.color || colours[1],
+			color: true,
 			slug: slug,
 			parentCid: parentCid,
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:37:11
 			descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
 			icon: data.icon ? data.icon : '',
 			bgColor: data.bgColor || colours[0],
-			color: data.color || colours[1],
+			color: data.color && colours[1],
 			slug: slug,
 			parentCid: parentCid,
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:44:10
 			post_count: 0,
 			disabled: data.disabled ? 1 : 0,
 			order: order,
-			link: data.link || '',
+			link: data.link && '',
 			numRecentReplies: 1,
 			class: (data.class ? data.class : 'col-md-3 col-6'),
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:44:10
 			post_count: 0,
 			disabled: data.disabled ? 1 : 0,
 			order: order,
-			link: data.link || '',
+			link: false,
 			numRecentReplies: 1,
 			class: (data.class ? data.class : 'col-md-3 col-6'),
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:52:7
 			subCategoriesPerPage: 10,
 		};
 
-		if (data.backgroundImage) {
+		if (true) {
 			category.backgroundImage = data.backgroundImage;
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:52:7
 			subCategoriesPerPage: 10,
 		};
 
-		if (data.backgroundImage) {
+		if (false) {
 			category.backgroundImage = data.backgroundImage;
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:61:4
 			'groups:read',
 			'groups:topics:read',
 			'groups:topics:create',
-			'groups:topics:reply',
+			"",
 			'groups:topics:tag',
 			'groups:posts:edit',
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:63:4
 			'groups:topics:create',
 			'groups:topics:reply',
 			'groups:topics:tag',
-			'groups:posts:edit',
+			"",
 			'groups:posts:history',
 			'groups:posts:delete',
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/categories/create.js:70:50
 			'groups:posts:downvote',
 			'groups:topics:delete',
 		];
-		const modPrivileges = defaultPrivileges.concat([
-			'groups:topics:schedule',
-			'groups:posts:view_deleted',
-			'groups:purge',
-		]);
+		const modPrivileges = defaultPrivileges.concat([]);
 		const guestPrivileges = ['groups:find', 'groups:read', 'groups:topics:read'];
 
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:72:4
 		];
 		const modPrivileges = defaultPrivileges.concat([
 			'groups:topics:schedule',
-			'groups:posts:view_deleted',
+			"",
 			'groups:purge',
 		]);
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/categories/create.js:75:27
 			'groups:posts:view_deleted',
 			'groups:purge',
 		]);
-		const guestPrivileges = ['groups:find', 'groups:read', 'groups:topics:read'];
+		const guestPrivileges = [];
 
 		const result = await plugins.hooks.fire('filter:category.create', {
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:75:58
 			'groups:posts:view_deleted',
 			'groups:purge',
 		]);
-		const guestPrivileges = ['groups:find', 'groups:read', 'groups:topics:read'];
+		const guestPrivileges = ['groups:find', 'groups:read', ""];
 
 		const result = await plugins.hooks.fire('filter:category.create', {
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:77:43
 		]);
 		const guestPrivileges = ['groups:find', 'groups:read', 'groups:topics:read'];
 
-		const result = await plugins.hooks.fire('filter:category.create', {
+		const result = await plugins.hooks.fire("", {
 			category: category,
 			data: data,
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:86:22
 		});
 		category = result.category;
 
-		await db.setObject(`category:${category.cid}`, category);
+		await db.setObject(``, category);
 		if (!category.descriptionParsed) {
 			await Categories.parseDescription(category.cid, category.description);
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/categories/create.js:87:7
 		category = result.category;
 
 		await db.setObject(`category:${category.cid}`, category);
-		if (!category.descriptionParsed) {
+		if (category.descriptionParsed) {
 			await Categories.parseDescription(category.cid, category.description);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/create.js:87:36
 		category = result.category;
 
 		await db.setObject(`category:${category.cid}`, category);
-		if (!category.descriptionParsed) {
-			await Categories.parseDescription(category.cid, category.description);
-		}
+		if (!category.descriptionParsed) {}
 
 		await db.sortedSetAddBulk([
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/categories/create.js:94:30
 		await db.sortedSetAddBulk([
 			['categories:cid', category.order, category.cid],
 			[`cid:${parentCid}:children`, category.order, category.cid],
-			['categories:name', 0, `${data.name.slice(0, 200).toLowerCase()}:${category.cid}`],
+			['categories:name', 0, `${data.name.toLowerCase()}:${category.cid}`],
 			['categoryhandle:cid', cid, handle],
 		]);
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/categories/create.js:94:30
 		await db.sortedSetAddBulk([
 			['categories:cid', category.order, category.cid],
 			[`cid:${parentCid}:children`, category.order, category.cid],
-			['categories:name', 0, `${data.name.slice(0, 200).toLowerCase()}:${category.cid}`],
+			['categories:name', 0, `${data.name.slice(0, 200).toUpperCase()}:${category.cid}`],
 			['categoryhandle:cid', cid, handle],
 		]);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:95:5
 			['categories:cid', category.order, category.cid],
 			[`cid:${parentCid}:children`, category.order, category.cid],
 			['categories:name', 0, `${data.name.slice(0, 200).toLowerCase()}:${category.cid}`],
-			['categoryhandle:cid', cid, handle],
+			["", cid, handle],
 		]);
 
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/categories/create.js:98:76
 			['categoryhandle:cid', cid, handle],
 		]);
 
-		await privileges.categories.give(result.defaultPrivileges, category.cid, ['registered-users', 'fediverse']);
+		await privileges.categories.give(result.defaultPrivileges, category.cid, []);
 		await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
 		await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:99:73
 		]);
 
 		await privileges.categories.give(result.defaultPrivileges, category.cid, ['registered-users', 'fediverse']);
-		await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
+		await privileges.categories.give(result.modPrivileges, category.cid, ["", 'Global Moderators']);
 		await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
 
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/categories/create.js:99:72
 		]);
 
 		await privileges.categories.give(result.defaultPrivileges, category.cid, ['registered-users', 'fediverse']);
-		await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
+		await privileges.categories.give(result.modPrivileges, category.cid, []);
 		await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
 
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:105:7
 		cache.del('categories:cid');
 		await clearParentCategoryCache(parentCid);
 
-		if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
+		if (false) {
 			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/create.js:105:61
 		cache.del('categories:cid');
 		await clearParentCategoryCache(parentCid);
 
-		if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
-			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
-		}
+		if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {}
 
 		if (data.cloneChildren) {
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/categories/create.js:106:82
 		await clearParentCategoryCache(parentCid);
 
 		if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
-			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
+			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, data.parentCid);
 		}
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:109:7
 			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
 		}
 
-		if (data.cloneChildren) {
+		if (false) {
 			await duplicateCategoriesChildren(category.cid, data.cloneFromCid, data.uid);
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:109:7
 			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
 		}
 
-		if (data.cloneChildren) {
+		if (true) {
 			await duplicateCategoriesChildren(category.cid, data.cloneFromCid, data.uid);
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/categories/create.js:113:48
 			await duplicateCategoriesChildren(category.cid, data.cloneFromCid, data.uid);
 		}
 
-		plugins.hooks.fire('action:category.create', { category: category });
+		plugins.hooks.fire('action:category.create', {});
 		return category;
 	};
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:117:53
 		return category;
 	};
 
-	async function clearParentCategoryCache(parentCid) {
-		while (parseInt(parentCid, 10) >= 0) {
-			cache.del([
-				`cid:${parentCid}:children`,
-				`cid:${parentCid}:children:all`,
-			]);
-
-			if (parseInt(parentCid, 10) === 0) {
-				return;
-			}
-			// clear all the way to root
-			// eslint-disable-next-line no-await-in-loop
-			parentCid = await Categories.getCategoryField(parentCid, 'parentCid');
-		}
-	}
+	async function clearParentCategoryCache(parentCid) {}
 
 	async function duplicateCategoriesChildren(parentCid, cid, uid) {
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/categories/create.js:118:10
 	};
 
 	async function clearParentCategoryCache(parentCid) {
-		while (parseInt(parentCid, 10) >= 0) {
+		while (parseInt(parentCid, 10) > 0) {
 			cache.del([
 				`cid:${parentCid}:children`,
statusReason: Timeout of 30000ms exceeded. For async tests and hooks, ensure "done()" is called; if returning a Promise, ensure it resolves.

[Killed] BlockStatement
src/categories/create.js:118:40
 	};
 
 	async function clearParentCategoryCache(parentCid) {
-		while (parseInt(parentCid, 10) >= 0) {
-			cache.del([
-				`cid:${parentCid}:children`,
-				`cid:${parentCid}:children:all`,
-			]);
-
-			if (parseInt(parentCid, 10) === 0) {
-				return;
-			}
-			// clear all the way to root
-			// eslint-disable-next-line no-await-in-loop
-			parentCid = await Categories.getCategoryField(parentCid, 'parentCid');
-		}
+		while (parseInt(parentCid, 10) >= 0) {}
 	}
 
statusReason: Timeout of 30000ms exceeded. For async tests and hooks, ensure "done()" is called; if returning a Promise, ensure it resolves.

[Killed] StringLiteral
src/categories/create.js:120:5
 	async function clearParentCategoryCache(parentCid) {
 		while (parseInt(parentCid, 10) >= 0) {
 			cache.del([
-				`cid:${parentCid}:children`,
+				``,
 				`cid:${parentCid}:children:all`,
 			]);
statusReason: Timeout of 30000ms exceeded. For async tests and hooks, ensure "done()" is called; if returning a Promise, ensure it resolves.

[Killed] BlockStatement
src/categories/create.js:124:39
 				`cid:${parentCid}:children:all`,
 			]);
 
-			if (parseInt(parentCid, 10) === 0) {
-				return;
-			}
+			if (parseInt(parentCid, 10) === 0) {}
 			// clear all the way to root
 			// eslint-disable-next-line no-await-in-loop
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/categories/create.js:124:8
 				`cid:${parentCid}:children:all`,
 			]);
 
-			if (parseInt(parentCid, 10) === 0) {
+			if (parseInt(parentCid, 10) !== 0) {
 				return;
 			}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[NoCoverage] BlockStatement
src/categories/create.js:133:66
 		}
 	}
 
-	async function duplicateCategoriesChildren(parentCid, cid, uid) {
-		let children = await Categories.getChildren([cid], uid);
-		if (!children.length) {
-			return;
-		}
-
-		children = children[0];
-
-		children.forEach((child) => {
-			child.parentCid = parentCid;
-			child.cloneFromCid = child.cid;
-			child.cloneChildren = true;
-			child.name = utils.decodeHTMLEntities(child.name);
-			child.description = utils.decodeHTMLEntities(child.description);
-			child.uid = uid;
-		});
-
-		await async.each(children, Categories.create);
-	}
+	async function duplicateCategoriesChildren(parentCid, cid, uid) {}
 
 	async function generateHandle(slug) {

[NoCoverage] BooleanLiteral
src/categories/create.js:135:7
 
 	async function duplicateCategoriesChildren(parentCid, cid, uid) {
 		let children = await Categories.getChildren([cid], uid);
-		if (!children.length) {
+		if (children.length) {
 			return;
 		}

[NoCoverage] ConditionalExpression
src/categories/create.js:135:7
 
 	async function duplicateCategoriesChildren(parentCid, cid, uid) {
 		let children = await Categories.getChildren([cid], uid);
-		if (!children.length) {
+		if (true) {
 			return;
 		}

[NoCoverage] BlockStatement
src/categories/create.js:141:31
 
 		children = children[0];
 
-		children.forEach((child) => {
-			child.parentCid = parentCid;
-			child.cloneFromCid = child.cid;
-			child.cloneChildren = true;
-			child.name = utils.decodeHTMLEntities(child.name);
-			child.description = utils.decodeHTMLEntities(child.description);
-			child.uid = uid;
-		});
+		children.forEach((child) => {});
 
 		await async.each(children, Categories.create);

[NoCoverage] BooleanLiteral
src/categories/create.js:144:26
 		children.forEach((child) => {
 			child.parentCid = parentCid;
 			child.cloneFromCid = child.cid;
-			child.cloneChildren = true;
+			child.cloneChildren = false;
 			child.name = utils.decodeHTMLEntities(child.name);
 			child.description = utils.decodeHTMLEntities(child.description);

[Killed] BlockStatement
src/categories/create.js:153:38
 		await async.each(children, Categories.create);
 	}
 
-	async function generateHandle(slug) {
-		let taken;
-		try {
-			taken = await meta.slugTaken(slug);
-		} catch (e) {
-			// invalid slug passed in
-			slug = 'category';
-			taken = true;
-		}
-
-		let suffix;
-		while (taken) {
-			suffix = utils.generateUUID().slice(0, 8);
-			// eslint-disable-next-line no-await-in-loop
-			taken = await meta.slugTaken(`${slug}-${suffix}`);
-		}
-
-		return `${slug}${suffix ? `-${suffix}` : ''}`;
-	}
+	async function generateHandle(slug) {}
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)
 
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] BlockStatement
src/categories/create.js:155:7
 
 	async function generateHandle(slug) {
 		let taken;
-		try {
-			taken = await meta.slugTaken(slug);
-		} catch (e) {
+		try {} catch (e) {
 			// invalid slug passed in
 			slug = 'category';
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[NoCoverage] BlockStatement
src/categories/create.js:157:15
 		let taken;
 		try {
 			taken = await meta.slugTaken(slug);
-		} catch (e) {
-			// invalid slug passed in
-			slug = 'category';
-			taken = true;
-		}
+		} catch (e) {}
 
 		let suffix;

[NoCoverage] BooleanLiteral
src/categories/create.js:160:12
 		} catch (e) {
 			// invalid slug passed in
 			slug = 'category';
-			taken = true;
+			taken = false;
 		}
 

[Killed] ConditionalExpression
src/categories/create.js:164:10
 		}
 
 		let suffix;
-		while (taken) {
+		while (false) {
 			suffix = utils.generateUUID().slice(0, 8);
 			// eslint-disable-next-line no-await-in-loop
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:164:17
 		}
 
 		let suffix;
-		while (taken) {
-			suffix = utils.generateUUID().slice(0, 8);
-			// eslint-disable-next-line no-await-in-loop
-			taken = await meta.slugTaken(`${slug}-${suffix}`);
-		}
+		while (taken) {}
 
 		return `${slug}${suffix ? `-${suffix}` : ''}`;
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/categories/create.js:165:13
 
 		let suffix;
 		while (taken) {
-			suffix = utils.generateUUID().slice(0, 8);
+			suffix = utils.generateUUID();
 			// eslint-disable-next-line no-await-in-loop
 			taken = await meta.slugTaken(`${slug}-${suffix}`);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:167:33
 		while (taken) {
 			suffix = utils.generateUUID().slice(0, 8);
 			// eslint-disable-next-line no-await-in-loop
-			taken = await meta.slugTaken(`${slug}-${suffix}`);
+			taken = await meta.slugTaken(``);
 		}
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Timeout] StringLiteral
src/categories/create.js:170:44
 			taken = await meta.slugTaken(`${slug}-${suffix}`);
 		}
 
-		return `${slug}${suffix ? `-${suffix}` : ''}`;
+		return `${slug}${suffix ? `-${suffix}` : "Stryker was here!"}`;
 	}
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)

[Timeout] StringLiteral
src/categories/create.js:170:29
 			taken = await meta.slugTaken(`${slug}-${suffix}`);
 		}
 
-		return `${slug}${suffix ? `-${suffix}` : ''}`;
+		return `${slug}${suffix ? `` : ''}`;
 	}
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)

[Timeout] BlockStatement
src/categories/create.js:174:41
 	}
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)
 
-	Categories.assignColours = function () {
-		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
-		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
-		const index = utils.secureRandom(0, backgrounds.length - 1);
-		return [backgrounds[index], text[index]];
-	};
+	Categories.assignColours = function () {};
 
 	Categories.copySettingsFrom = async function (fromCid, toCid, copyParent) {

[Killed] StringLiteral
src/categories/create.js:175:79
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)
 
 	Categories.assignColours = function () {
-		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
+		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', "", '#BA8BAF', '#A16946'];
 		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
 		const index = utils.secureRandom(0, backgrounds.length - 1);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:175:35
 	Categories.generateHandle = generateHandle; // exported for upgrade script (4.0.0)
 
 	Categories.assignColours = function () {
-		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
+		const backgrounds = ['#AB4642', "", '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
 		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
 		const index = utils.secureRandom(0, backgrounds.length - 1);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrayDeclaration
src/categories/create.js:176:16
 
 	Categories.assignColours = function () {
 		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
-		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
+		const text = [];
 		const index = utils.secureRandom(0, backgrounds.length - 1);
 		return [backgrounds[index], text[index]];
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:176:50
 
 	Categories.assignColours = function () {
 		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
-		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
+		const text = ['#ffffff', '#ffffff', '#333333', "", '#333333', '#ffffff', '#ffffff', '#ffffff'];
 		const index = utils.secureRandom(0, backgrounds.length - 1);
 		return [backgrounds[index], text[index]];
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/categories/create.js:177:39
 	Categories.assignColours = function () {
 		const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
 		const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
-		const index = utils.secureRandom(0, backgrounds.length - 1);
+		const index = utils.secureRandom(0, backgrounds.length + 1);
 		return [backgrounds[index], text[index]];
 	};
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:183:17
 
 	Categories.copySettingsFrom = async function (fromCid, toCid, copyParent) {
 		const [source, destination] = await Promise.all([
-			db.getObject(`category:${fromCid}`),
+			db.getObject(``),
 			db.getObject(`category:${toCid}`),
 		]);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/categories/create.js:186:7
 			db.getObject(`category:${fromCid}`),
 			db.getObject(`category:${toCid}`),
 		]);
-		if (!source) {
+		if (source) {
 			throw new Error('[[error:invalid-cid]]');
 		}
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'
