[Killed] ConditionalExpression
src/categories/create.js:186:7
 			db.getObject(`category:${fromCid}`),
 			db.getObject(`category:${toCid}`),
 		]);
-		if (!source) {
+		if (false) {
 			throw new Error('[[error:invalid-cid]]');
 		}
statusReason: Listen method has been called more than once without closing.

[NoCoverage] StringLiteral
src/categories/create.js:187:20
 			db.getObject(`category:${toCid}`),
 		]);
 		if (!source) {
-			throw new Error('[[error:invalid-cid]]');
+			throw new Error("");
 		}
 

[Killed] ConditionalExpression
src/categories/create.js:190:21
 			throw new Error('[[error:invalid-cid]]');
 		}
 
-		const oldParent = parseInt(destination.parentCid, 10) || 0;
+		const oldParent = true;
 		const newParent = parseInt(source.parentCid, 10) || 0;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/categories/create.js:190:21
 			throw new Error('[[error:invalid-cid]]');
 		}
 
-		const oldParent = parseInt(destination.parentCid, 10) || 0;
+		const oldParent = parseInt(destination.parentCid, 10) && 0;
 		const newParent = parseInt(source.parentCid, 10) || 0;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:191:21
 		}
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
-		const newParent = parseInt(source.parentCid, 10) || 0;
+		const newParent = false;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:191:21
 		}
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
-		const newParent = parseInt(source.parentCid, 10) || 0;
+		const newParent = parseInt(source.parentCid, 10) && 0;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/categories/create.js:192:7
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
 		const newParent = parseInt(source.parentCid, 10) || 0;
-		if (copyParent && newParent !== parseInt(toCid, 10)) {
+		if (copyParent || newParent !== parseInt(toCid, 10)) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
 			await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:192:7
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
 		const newParent = parseInt(source.parentCid, 10) || 0;
-		if (copyParent && newParent !== parseInt(toCid, 10)) {
+		if (true) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
 			await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:194:26
 		const newParent = parseInt(source.parentCid, 10) || 0;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
-			await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
+			await db.sortedSetAdd(``, source.order, toCid);
 			cache.del([
 				`cid:${oldParent}:children`,
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:199:5
 				`cid:${oldParent}:children`,
 				`cid:${oldParent}:children:all`,
 				`cid:${newParent}:children`,
-				`cid:${newParent}:children:all`,
+				``,
 			]);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:216:7
 		destination.minTags = source.minTags;
 		destination.maxTags = source.maxTags;
 
-		if (copyParent) {
+		if (true) {
 			destination.parentCid = source.parentCid || 0;
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:216:7
 		destination.minTags = source.minTags;
 		destination.maxTags = source.maxTags;
 
-		if (copyParent) {
+		if (false) {
 			destination.parentCid = source.parentCid || 0;
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:217:28
 		destination.maxTags = source.maxTags;
 
 		if (copyParent) {
-			destination.parentCid = source.parentCid || 0;
+			destination.parentCid = false;
 		}
 		await plugins.hooks.fire('filter:categories.copySettingsFrom', {
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] LogicalOperator
src/categories/create.js:217:28
 		destination.maxTags = source.maxTags;
 
 		if (copyParent) {
-			destination.parentCid = source.parentCid || 0;
+			destination.parentCid = source.parentCid && 0;
 		}
 		await plugins.hooks.fire('filter:categories.copySettingsFrom', {
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/categories/create.js:219:66
 		if (copyParent) {
 			destination.parentCid = source.parentCid || 0;
 		}
-		await plugins.hooks.fire('filter:categories.copySettingsFrom', {
-			source: source,
-			destination: destination,
-			copyParent: copyParent,
-		});
+		await plugins.hooks.fire('filter:categories.copySettingsFrom', {});
 
 		await db.setObject(`category:${toCid}`, destination);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:234:50
 		return destination;
 	};
 
-	async function copyTagWhitelist(fromCid, toCid) {
-		const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
-		await db.delete(`cid:${toCid}:tag:whitelist`);
-		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
-		cache.del(`cid:${toCid}:tag:whitelist`);
-	}
+	async function copyTagWhitelist(fromCid, toCid) {}
 
 	Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter) {
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] UnaryOperator
src/categories/create.js:235:88
 	};
 
 	async function copyTagWhitelist(fromCid, toCid) {
-		const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
+		const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, +1);
 		await db.delete(`cid:${toCid}:tag:whitelist`);
 		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/categories/create.js:237:94
 	async function copyTagWhitelist(fromCid, toCid) {
 		const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
 		await db.delete(`cid:${toCid}:tag:whitelist`);
-		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
+		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(() => undefined));
 		cache.del(`cid:${toCid}:tag:whitelist`);
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:237:64
 	async function copyTagWhitelist(fromCid, toCid) {
 		const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
 		await db.delete(`cid:${toCid}:tag:whitelist`);
-		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
+		await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(() => undefined), data.map(item => item.value));
 		cache.del(`cid:${toCid}:tag:whitelist`);
 	}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:241:81
 		cache.del(`cid:${toCid}:tag:whitelist`);
 	}
 
-	Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter) {
-		group = group || '';
-		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
-
-		if (group) {
-			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
-		} else {
-			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
-		}
-
-		const data = await plugins.hooks.fire('filter:categories.copyPrivilegesFrom', {
-			privileges: privsToCopy,
-			fromCid: fromCid,
-			toCid: toCid,
-			group: group,
-		});
-		if (group) {
-			await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
-		} else {
-			await copyPrivileges(data.privileges, data.fromCid, data.toCid);
-		}
-	};
+	Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter) {};
 
 	async function copyPrivileges(privileges, fromCid, toCid) {
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/categories/create.js:242:11
 	}
 
 	Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter) {
-		group = group || '';
+		group = group && '';
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/create.js:242:11
 	}
 
 	Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter) {
-		group = group || '';
+		group = false;
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:245:14
 		group = group || '';
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
-		if (group) {
-			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
-		} else {
+		if (group) {} else {
 			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:245:7
 		group = group || '';
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
-		if (group) {
+		if (true) {
 			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
 		} else {
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:246:34
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
 		if (group) {
-			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
+			privsToCopy = privsToCopy.map(() => undefined);
 		} else {
 			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:246:42
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
 		if (group) {
-			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
+			privsToCopy = privsToCopy.map(priv => ``);
 		} else {
 			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:247:10
 
 		if (group) {
 			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
-		} else {
-			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
-		}
+		} else {}
 
 		const data = await plugins.hooks.fire('filter:categories.copyPrivilegesFrom', {
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:248:53
 		if (group) {
 			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
 		} else {
-			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
+			privsToCopy = privsToCopy.concat(privsToCopy.map(() => undefined));
 		}
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:248:61
 		if (group) {
 			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
 		} else {
-			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
+			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => ``));
 		}
 
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:251:41
 			privsToCopy = privsToCopy.concat(privsToCopy.map(priv => `groups:${priv}`));
 		}
 
-		const data = await plugins.hooks.fire('filter:categories.copyPrivilegesFrom', {
+		const data = await plugins.hooks.fire("", {
 			privileges: privsToCopy,
 			fromCid: fromCid,
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:257:7
 			toCid: toCid,
 			group: group,
 		});
-		if (group) {
+		if (true) {
 			await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
 		} else {
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:257:14
 			toCid: toCid,
 			group: group,
 		});
-		if (group) {
-			await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
-		} else {
+		if (group) {} else {
 			await copyPrivileges(data.privileges, data.fromCid, data.toCid);
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:259:10
 		});
 		if (group) {
 			await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
-		} else {
-			await copyPrivileges(data.privileges, data.fromCid, data.toCid);
-		}
+		} else {}
 	};
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:264:60
 		}
 	};
 
-	async function copyPrivileges(privileges, fromCid, toCid) {
-		const toGroups = privileges.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
-		const fromGroups = privileges.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
-
-		const currentMembers = await db.getSortedSetsMembers(toGroups.concat(fromGroups));
-		const copyGroups = _.uniq(_.flatten(currentMembers));
-		await async.each(copyGroups, async (group) => {
-			await copyPrivilegesByGroup(privileges, fromCid, toCid, group);
-		});
-	}
+	async function copyPrivileges(privileges, fromCid, toCid) {}
 
 	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:265:35
 	};
 
 	async function copyPrivileges(privileges, fromCid, toCid) {
-		const toGroups = privileges.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
+		const toGroups = privileges.map(() => undefined);
 		const fromGroups = privileges.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:265:48
 	};
 
 	async function copyPrivileges(privileges, fromCid, toCid) {
-		const toGroups = privileges.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
+		const toGroups = privileges.map(privilege => ``);
 		const fromGroups = privileges.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
 
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:266:37
 
 	async function copyPrivileges(privileges, fromCid, toCid) {
 		const toGroups = privileges.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
-		const fromGroups = privileges.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
+		const fromGroups = privileges.map(() => undefined);
 
 		const currentMembers = await db.getSortedSetsMembers(toGroups.concat(fromGroups));
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:266:50
 
 	async function copyPrivileges(privileges, fromCid, toCid) {
 		const toGroups = privileges.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
-		const fromGroups = privileges.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
+		const fromGroups = privileges.map(privilege => ``);
 
 		const currentMembers = await db.getSortedSetsMembers(toGroups.concat(fromGroups));
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/create.js:270:49
 
 		const currentMembers = await db.getSortedSetsMembers(toGroups.concat(fromGroups));
 		const copyGroups = _.uniq(_.flatten(currentMembers));
-		await async.each(copyGroups, async (group) => {
-			await copyPrivilegesByGroup(privileges, fromCid, toCid, group);
-		});
+		await async.each(copyGroups, async (group) => {});
 	}
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/create.js:275:77
 		});
 	}
 
-	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
-		const fromGroups = privilegeList.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
-		const toGroups = privilegeList.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
-		const [fromChecks, toChecks] = await Promise.all([
-			db.isMemberOfSortedSets(fromGroups, group),
-			db.isMemberOfSortedSets(toGroups, group),
-		]);
-		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
-		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
-		await privileges.categories.give(givePrivs, toCid, group);
-		await privileges.categories.rescind(rescindPrivs, toCid, group);
-	}
+	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {}
 };
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/categories/create.js:276:40
 	}
 
 	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
-		const fromGroups = privilegeList.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
+		const fromGroups = privilegeList.map(() => undefined);
 		const toGroups = privilegeList.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
 		const [fromChecks, toChecks] = await Promise.all([
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/create.js:276:53
 	}
 
 	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
-		const fromGroups = privilegeList.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
+		const fromGroups = privilegeList.map(privilege => ``);
 		const toGroups = privilegeList.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
 		const [fromChecks, toChecks] = await Promise.all([
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/create.js:277:38
 
 	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
 		const fromGroups = privilegeList.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
-		const toGroups = privilegeList.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
+		const toGroups = privilegeList.map(() => undefined);
 		const [fromChecks, toChecks] = await Promise.all([
 			db.isMemberOfSortedSets(fromGroups, group),
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/create.js:277:51
 
 	async function copyPrivilegesByGroup(privilegeList, fromCid, toCid, group) {
 		const fromGroups = privilegeList.map(privilege => `group:cid:${fromCid}:privileges:${privilege}:members`);
-		const toGroups = privilegeList.map(privilege => `group:cid:${toCid}:privileges:${privilege}:members`);
+		const toGroups = privilegeList.map(privilege => ``);
 		const [fromChecks, toChecks] = await Promise.all([
 			db.isMemberOfSortedSets(fromGroups, group),
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:282:59
 			db.isMemberOfSortedSets(fromGroups, group),
 			db.isMemberOfSortedSets(toGroups, group),
 		]);
-		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
+		const givePrivs = privilegeList.filter((priv, index) => true);
 		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
 		await privileges.categories.give(givePrivs, toCid, group);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/categories/create.js:282:80
 			db.isMemberOfSortedSets(fromGroups, group),
 			db.isMemberOfSortedSets(toGroups, group),
 		]);
-		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
+		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && toChecks[index]);
 		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
 		await privileges.categories.give(givePrivs, toCid, group);
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/create.js:283:62
 			db.isMemberOfSortedSets(toGroups, group),
 		]);
 		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
-		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
+		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] || toChecks[index]);
 		await privileges.categories.give(givePrivs, toCid, group);
 		await privileges.categories.rescind(rescindPrivs, toCid, group);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/create.js:283:62
 			db.isMemberOfSortedSets(toGroups, group),
 		]);
 		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
-		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
+		const rescindPrivs = privilegeList.filter((priv, index) => true);
 		await privileges.categories.give(givePrivs, toCid, group);
 		await privileges.categories.rescind(rescindPrivs, toCid, group);
statusReason: Listen method has been called more than once without closing.
