[Killed] BlockStatement
src/categories/delete.js:15:47
 const utils = require('../utils');
 
 module.exports = function (Categories) {
-	Categories.purge = async function (cid, uid) {
-		await batch.processSortedSet(`cid:${cid}:tids`, async (tids) => {
-			await async.eachLimit(tids, 10, async (tid) => {
-				await topics.purgePostsAndTopic(tid, uid);
-			});
-		}, { alwaysStartAt: 0 });
-
-		const pinnedTids = await db.getSortedSetRevRange(`cid:${cid}:tids:pinned`, 0, -1);
-		await async.eachLimit(pinnedTids, 10, async (tid) => {
-			await topics.purgePostsAndTopic(tid, uid);
-		});
-		const categoryData = await Categories.getCategoryData(cid);
-		await purgeCategory(cid, categoryData);
-		plugins.hooks.fire('action:category.delete', { cid: cid, uid: uid, category: categoryData });
-	};
+	Categories.purge = async function (cid, uid) {};
 
 	async function purgeCategory(cid, categoryData) {
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/delete.js:16:67
 
 module.exports = function (Categories) {
 	Categories.purge = async function (cid, uid) {
-		await batch.processSortedSet(`cid:${cid}:tids`, async (tids) => {
-			await async.eachLimit(tids, 10, async (tid) => {
-				await topics.purgePostsAndTopic(tid, uid);
-			});
-		}, { alwaysStartAt: 0 });
+		await batch.processSortedSet(`cid:${cid}:tids`, async (tids) => {}, { alwaysStartAt: 0 });
 
 		const pinnedTids = await db.getSortedSetRevRange(`cid:${cid}:tids:pinned`, 0, -1);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:16:32
 
 module.exports = function (Categories) {
 	Categories.purge = async function (cid, uid) {
-		await batch.processSortedSet(`cid:${cid}:tids`, async (tids) => {
+		await batch.processSortedSet(``, async (tids) => {
 			await async.eachLimit(tids, 10, async (tid) => {
 				await topics.purgePostsAndTopic(tid, uid);
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/delete.js:17:51
 module.exports = function (Categories) {
 	Categories.purge = async function (cid, uid) {
 		await batch.processSortedSet(`cid:${cid}:tids`, async (tids) => {
-			await async.eachLimit(tids, 10, async (tid) => {
-				await topics.purgePostsAndTopic(tid, uid);
-			});
+			await async.eachLimit(tids, 10, async (tid) => {});
 		}, { alwaysStartAt: 0 });
 
statusReason: Listen method has been called more than once without closing.

[Killed] UnaryOperator
src/categories/delete.js:22:81
 			});
 		}, { alwaysStartAt: 0 });
 
-		const pinnedTids = await db.getSortedSetRevRange(`cid:${cid}:tids:pinned`, 0, -1);
+		const pinnedTids = await db.getSortedSetRevRange(`cid:${cid}:tids:pinned`, 0, +1);
 		await async.eachLimit(pinnedTids, 10, async (tid) => {
 			await topics.purgePostsAndTopic(tid, uid);
statusReason: Listen method has been called more than once without closing.

[NoCoverage] BlockStatement
src/categories/delete.js:23:56
 		}, { alwaysStartAt: 0 });
 
 		const pinnedTids = await db.getSortedSetRevRange(`cid:${cid}:tids:pinned`, 0, -1);
-		await async.eachLimit(pinnedTids, 10, async (tid) => {
-			await topics.purgePostsAndTopic(tid, uid);
-		});
+		await async.eachLimit(pinnedTids, 10, async (tid) => {});
 		const categoryData = await Categories.getCategoryData(cid);
 		await purgeCategory(cid, categoryData);

[Killed] ObjectLiteral
src/categories/delete.js:28:48
 		});
 		const categoryData = await Categories.getCategoryData(cid);
 		await purgeCategory(cid, categoryData);
-		plugins.hooks.fire('action:category.delete', { cid: cid, uid: uid, category: categoryData });
+		plugins.hooks.fire('action:category.delete', {});
 	};
 
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/categories/delete.js:33:7
 
 	async function purgeCategory(cid, categoryData) {
 		const bulkRemove = [['categories:cid', cid]];
-		if (categoryData && categoryData.name) {
+		if (categoryData || categoryData.name) {
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/delete.js:33:7
 
 	async function purgeCategory(cid, categoryData) {
 		const bulkRemove = [['categories:cid', cid]];
-		if (categoryData && categoryData.name) {
+		if (true) {
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/categories/delete.js:34:43
 	async function purgeCategory(cid, categoryData) {
 		const bulkRemove = [['categories:cid', cid]];
 		if (categoryData && categoryData.name) {
-			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
+			bulkRemove.push(['categories:name', `${categoryData.name.toLowerCase()}:${cid}`]);
 		}
 		if (categoryData && categoryData.handle) {
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/categories/delete.js:34:43
 	async function purgeCategory(cid, categoryData) {
 		const bulkRemove = [['categories:cid', cid]];
 		if (categoryData && categoryData.name) {
-			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
+			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toUpperCase()}:${cid}`]);
 		}
 		if (categoryData && categoryData.handle) {
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/delete.js:36:7
 		if (categoryData && categoryData.name) {
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
-		if (categoryData && categoryData.handle) {
+		if (false) {
 			bulkRemove.push(['categoryhandle:cid', categoryData.handle]);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/categories/delete.js:36:7
 		if (categoryData && categoryData.name) {
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
-		if (categoryData && categoryData.handle) {
+		if (true) {
 			bulkRemove.push(['categoryhandle:cid', categoryData.handle]);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/categories/delete.js:37:20
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
 		if (categoryData && categoryData.handle) {
-			bulkRemove.push(['categoryhandle:cid', categoryData.handle]);
+			bulkRemove.push([]);
 		}
 		await db.sortedSetRemoveBulk(bulkRemove);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:37:21
 			bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
 		}
 		if (categoryData && categoryData.handle) {
-			bulkRemove.push(['categoryhandle:cid', categoryData.handle]);
+			bulkRemove.push(["", categoryData.handle]);
 		}
 		await db.sortedSetRemoveBulk(bulkRemove);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:46:4
 		await activitypub.actors.removeGroup(cid);
 		await db.deleteAll([
 			`cid:${cid}:tids`,
-			`cid:${cid}:tids:pinned`,
+			``,
 			`cid:${cid}:tids:posts`,
 			`cid:${cid}:tids:votes`,
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:47:4
 		await db.deleteAll([
 			`cid:${cid}:tids`,
 			`cid:${cid}:tids:pinned`,
-			`cid:${cid}:tids:posts`,
+			``,
 			`cid:${cid}:tids:votes`,
 			`cid:${cid}:tids:views`,
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:57:29
 			`cid:${cid}:uid:watch:state`,
 			`cid:${cid}:children`,
 			`cid:${cid}:tag:whitelist`,
-			`${utils.isNumber(cid) ? 'category' : 'categoryRemote'}:${cid}`,
+			`${utils.isNumber(cid) ? "" : 'categoryRemote'}:${cid}`,
 		]);
 		const privilegeList = await privileges.categories.getPrivilegeList();
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:57:4
 			`cid:${cid}:uid:watch:state`,
 			`cid:${cid}:children`,
 			`cid:${cid}:tag:whitelist`,
-			`${utils.isNumber(cid) ? 'category' : 'categoryRemote'}:${cid}`,
+			``,
 		]);
 		const privilegeList = await privileges.categories.getPrivilegeList();
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/categories/delete.js:60:42
 			`${utils.isNumber(cid) ? 'category' : 'categoryRemote'}:${cid}`,
 		]);
 		const privilegeList = await privileges.categories.getPrivilegeList();
-		await groups.destroy(privilegeList.map(privilege => `cid:${cid}:privileges:${privilege}`));
+		await groups.destroy(privilegeList.map(() => undefined));
 	}
 
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:65:37
 
 	async function removeFromParent(cid) {
 		const [parentCid, children] = await Promise.all([
-			Categories.getCategoryField(cid, 'parentCid'),
+			Categories.getCategoryField(cid, ""),
 			db.getSortedSetRange(`cid:${cid}:children`, 0, -1),
 		]);
statusReason: Listen method has been called more than once without closing.

[Killed] UnaryOperator
src/categories/delete.js:66:51
 	async function removeFromParent(cid) {
 		const [parentCid, children] = await Promise.all([
 			Categories.getCategoryField(cid, 'parentCid'),
-			db.getSortedSetRange(`cid:${cid}:children`, 0, -1),
+			db.getSortedSetRange(`cid:${cid}:children`, 0, +1),
 		]);
 
statusReason: Listen method has been called more than once without closing.

[NoCoverage] BlockStatement
src/categories/delete.js:70:46
 		]);
 
 		const bulkAdd = [];
-		const childrenKeys = children.map((cid) => {
-			bulkAdd.push(['cid:0:children', cid, cid]);
-			return `category:${cid}`;
-		});
+		const childrenKeys = children.map((cid) => {});
 
 		await Promise.all([

[Killed] StringLiteral
src/categories/delete.js:76:23
 		});
 
 		await Promise.all([
-			db.sortedSetRemove(`cid:${parentCid}:children`, cid),
+			db.sortedSetRemove(``, cid),
 			db.setObjectField(childrenKeys, 'parentCid', 0),
 			db.sortedSetAddBulk(bulkAdd),
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:83:4
 
 		cache.del([
 			'categories:cid',
-			'cid:0:children',
+			"",
 			`cid:${parentCid}:children`,
 			`cid:${parentCid}:children:all`,
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:86:4
 			'cid:0:children',
 			`cid:${parentCid}:children`,
 			`cid:${parentCid}:children:all`,
-			`cid:${cid}:children`,
+			``,
 			`cid:${cid}:children:all`,
 			`cid:${cid}:tag:whitelist`,
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:87:4
 			`cid:${parentCid}:children`,
 			`cid:${parentCid}:children:all`,
 			`cid:${cid}:children`,
-			`cid:${cid}:children:all`,
+			``,
 			`cid:${cid}:tag:whitelist`,
 		]);
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/categories/delete.js:88:4
 			`cid:${parentCid}:children:all`,
 			`cid:${cid}:children`,
 			`cid:${cid}:children:all`,
-			`cid:${cid}:tag:whitelist`,
+			``,
 		]);
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/categories/delete.js:92:33
 		]);
 	}
 
-	async function deleteTags(cid) {
-		const tags = await db.getSortedSetMembers(`cid:${cid}:tags`);
-		await db.deleteAll(tags.map(tag => `cid:${cid}:tag:${tag}:topics`));
-		await db.delete(`cid:${cid}:tags`);
-	}
+	async function deleteTags(cid) {}
 };
 
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/delete.js:93:45
 	}
 
 	async function deleteTags(cid) {
-		const tags = await db.getSortedSetMembers(`cid:${cid}:tags`);
+		const tags = await db.getSortedSetMembers(``);
 		await db.deleteAll(tags.map(tag => `cid:${cid}:tag:${tag}:topics`));
 		await db.delete(`cid:${cid}:tags`);
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/categories/delete.js:94:31
 
 	async function deleteTags(cid) {
 		const tags = await db.getSortedSetMembers(`cid:${cid}:tags`);
-		await db.deleteAll(tags.map(tag => `cid:${cid}:tag:${tag}:topics`));
+		await db.deleteAll(tags.map(() => undefined));
 		await db.delete(`cid:${cid}:tags`);
 	}
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[NoCoverage] StringLiteral
src/categories/delete.js:94:38
 
 	async function deleteTags(cid) {
 		const tags = await db.getSortedSetMembers(`cid:${cid}:tags`);
-		await db.deleteAll(tags.map(tag => `cid:${cid}:tag:${tag}:topics`));
+		await db.deleteAll(tags.map(tag => ``));
 		await db.delete(`cid:${cid}:tags`);
 	}
