[Killed] BlockStatement
src/categories/create.js:109:27
 			category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
 		}
 
-		if (data.cloneChildren) {
-			await duplicateCategoriesChildren(category.cid, data.cloneFromCid, data.uid);
-		}
+		if (data.cloneChildren) {}
 
 		plugins.hooks.fire('action:category.create', { category: category });
killedBy: All tests
statusReason: info: configJSON

info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {

[Killed] ConditionalExpression
src/categories/create.js:118:10
 	};
 
 	async function clearParentCategoryCache(parentCid) {
-		while (parseInt(parentCid, 10) >= 0) {
+		while (false) {
 			cache.del([
 				`cid:${parentCid}:children`,
killedBy: All tests
statusReason: info: configJSON

info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {

[Killed] BlockStatement
src/categories/create.js:186:16
 			db.getObject(`category:${fromCid}`),
 			db.getObject(`category:${toCid}`),
 		]);
-		if (!source) {
-			throw new Error('[[error:invalid-cid]]');
-		}
+		if (!source) {}
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
killedBy: All tests
statusReason: info: configJSON

info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {

[Killed] ConditionalExpression
src/categories/create.js:191:21
 		}
 
 		const oldParent = parseInt(destination.parentCid, 10) || 0;
-		const newParent = parseInt(source.parentCid, 10) || 0;
+		const newParent = true;
 		if (copyParent && newParent !== parseInt(toCid, 10)) {
 			await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
killedBy: All tests
statusReason: info: configJSON

info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {

[Killed] ConditionalExpression
src/categories/create.js:245:7
 		group = group || '';
 		let privsToCopy = privileges.categories.getPrivilegesByFilter(filter);
 
-		if (group) {
+		if (false) {
 			privsToCopy = privsToCopy.map(priv => `groups:${priv}`);
 		} else {
killedBy: All tests
statusReason: info: configJSON

info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {

[Killed] MethodExpression
src/categories/create.js:282:21
 			db.isMemberOfSortedSets(fromGroups, group),
 			db.isMemberOfSortedSets(toGroups, group),
 		]);
-		const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
+		const givePrivs = privilegeList;
 		const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
 		await privileges.categories.give(givePrivs, toCid, group);
killedBy: All tests
statusReason: info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "119a6f87-8904-4659-85f2-e6651b7b6b49",
    "database": "redis",
    "port": "4567",
    "redis": {
        "host": "127.0.0.1",
